local Mod = ArachnaMod
local Item = Mod.Item

return function(modifiers)
	return {
		[Mod.PlayerType.ARACHNA] = {
			Name = "Арахна",
			Description = {
				"{{Collectible" .. Item.ARACHNAS_SPOOL.ID .. "}} Тепер дозволяє мати 2 активні павутини на підлозі",
				"#↑ Павучі Кокони мають більший шанс створити {{ColorRainbow}}особливих{{CR}} дружніх павуків",
				"#{{WebHeart}} 5% шанс створити Шовкове Серце під час вилуплення Павучого Кокона"
			}
		},
		[Mod.PlayerType.ARACHNA_B] = {
			Name = "Альт Арахна",
			Description = {
				"{{StatusWebbed}} Кокони, кинуті гравцем, створюють маленькі павутинки",
				"#Усього на підлозі може бути до трьох таких павутинок",
				"#Павутинки мають {{ColorRainbow}}особливі{{CR}} ефекти, що залежать від кольору кокона",
				"#{{StatusWebbed}} Монстри, що потрапили в них {{Slow}} сповільнюються, слабше відкидуються сльозами гравця та залишають Павучий Кокон після смерті",
				"#!!! Створені такими монстрами Павучі Кокони не будуть мати {{ColorRainbow}}особливих{{CR}} кольорів"
			}
		},
	}
end
