local Mod = ArachnaMod
local ARC_EID = Mod.EID_Support
local Item = Mod.Item

return function(modifiers)
	return {
		[Item.SPIDER_CAKE.ID] = {
			Name = "Павуче Тістечко",
			Description = {
				"{{WebHeart}} Створює 1 Шовкове Серце",
				"#Дає {{Collectible" .. CollectibleType.COLLECTIBLE_MYSTERY_GIFT .. "}} Таємничий Подарунок",
				function(descObj)
					local years = Item.SPIDER_CAKE:GetYearDifference()
					return string.format("Пройшло #%s роки з релізу моду!", years)
				end,
				function(descObj)
					local stats = modifiers[Item.SPIDER_CAKE.ID]._modifier(descObj)
					return "#↑ {{Speed}} +" .. stats.Speed .. " до Швидкості"
						.. "#↑ {{Tears}} +" .. stats.Tears .. " до Перезарядки сліз"
						.. "#↑ {{Damage}} +" .. stats.Damage .. " до Урону"
						.. "#↑ {{Range}} +" .. stats.Range .. " до Дальності сліз"
						.. "#↑ {{Shotspeed}} +" .. stats.ShotSpeed .. " до Швидкості сліз"
						.. "#↑ {{Luck}} +" .. stats.Luck .. " до Удачі"
				end
			},
			FallbackDescription = {
				"{{WebHeart}} Створює 1 Шовкове Серце",
				"#Дає {{Collectible" .. CollectibleType.COLLECTIBLE_MYSTERY_GIFT .. "}}",
				"#↑ + До усіх характеристик, в залежності від того скільки пройшла часу з релізу модифікації"
			}
		},
		[Item.SPIDER_DONUT.ID] = {
			Name = "Павучий Пончик",
			Description = {
				"{{WebHeart}} +1 Шовкове Серце",
				"#↑ {{Damage}} +0.69 одиниць урону",
				"#{{AracBlueSpider}} Створює 2-3 великих фіолетових павуків"
			}
		},
		[Item.OLD_SHOEBOX.ID] = {
			Name = "Коробка з-під взуття",
			Description = {
				"{{WebHeart}} Створює 1 Шовкове Серце",
				"#↑ {{Speed}} +0.15 до Швидкості гравця",
				"#↑ {{Tears}} +0.33 до Швидкості перезарядки сліз",
				"#{{AracBlueSpider}} Створює 7-14 синіх павуків"
			}
		},
		[Item.GUMMY_SPIDERS.ID] = {
			Name = "Желейні Павучки",
			Description = {
				"{{WebHeart}} +2 Шовкових Серця",
				"#↑ {{Tears}} +0.61 до Швидкості перезарядки сліз",
				"#{{AracBlueSpider}} Створює декілька {{ColorRainbow}}особливих{{CR}} дружніх павуків"
			}
		},
		[Item.CANDY_FLOSS.ID] = {
			Name = "Солодка Вата",
			Description = {
				"{{WebHeart}} Забирає усе червоне здоров'я (НЕ самі контейнери) гравця, створює як мінімум 3 Шовкових Серця поруч",
				"#{{Slow}} 5% шанс вистрілити сльозою, що розпадається на 4 маленькі частини та сповільнює монстрів",
				"#{{Luck}} 100% шанс при 20 одиницях удачі"
			}
		},
		[Item.ARACHNAS_SPOOL.ID] = {
			Name = "Арахнина Катушка",
			Description = {
				"{{Throwable}} Дає можливість кинути катушку, що залишить на підлозі велику павутину",
				"#{{StatusWebbed}} Монстри, які потрапляють до цієї павутини, {{Slow}} сповільнюються, слабше відкидуються сльозами гравця та залишають Павучий Кокон після смерті",
				"#{{AracBlueSpider}} Павучі Кокони вилупляються після проходження кімнати, створюючи кілька синіх павуків",
				"#{{BossRoom}} Якщо у павутині знаходиться бос, нанесення йому урону буде заповнювати особливу шкалу. Коли шкала заповниться, бос випустить декілька дружніх павуків"
			},
			BookOfBelial = {
				"Павутина {{Burning}} підпалює ворогів, як і сама катушка"
			}
		},
		[Item.DIVINE_CLOTH.ID] = {
			Name = "Божественні Полотна",
			Description = {
				"{{StatusSpiderBite}} Усі монстри навколо гравця отримують урон. До того ж, на них буде накладено ефект павутини Арахни. Такі монстри {{Slow}} сповільнюються, слабше відкидуються сльозами гравця та залишають Павучий Кокон після смерті",
				"#{{AracBlueSpider}} Павучі Кокони вилупляються після проходження кімнати, створюючи кілька синіх павуків",
				"#{{StatusSpiderBite}} Кокони можуть мати {{ColorRainbow}}особливі{{CR}} кольори. Усі павуки, що вилупляться з таких коконів, будуть мати такий самий {{ColorRainbow}}особливий{{CR}} колір",
				"#{{BossRoom}} Якщо ефект накладено на боса, нанесення йому урону буде заповнювати особливу шкалу. Коли шкала заповниться, бос створить Павучий Кокон"
			},
			BookOfBelial = {
				"{{Burning}} Підпалює ворогів поруч"
			}
		},
		[Item.EGG_TOSS.ID] = {
			Name = "Кидок Кокона",
			Description = {
				"{{Throwable}} Підійми та кинь Павучий Кокон!",
				"#{{AracBlueSpider}} Як і зазвичай, створює павуків та виконує {{ColorRainbow}}особливий{{CR}} ефект в залежності від кольору кокону, коли той кудись влучає",
				"#↑ Якщо кокон влучить в ворога, то він створить більше павуків і самі павуки будуть більшими",
			}
		},
		[Item.YARN.ID] = {
			Name = "Моток Пряжі",
			Description = {
				"Блокує ворожі сльози",
				"#Атакує монстрів поруч зарядами електричного струпу",
				"#{{WebHeart}} Створює 1 Шовкове Серце кожні 4 кімнати"
			}
		},
		[Item.ARACHNIDS_GRIP.ID] = {
			Name = "Павуча Хватка",
			Description = {
				"{{Poison}} 25% шанс вистрілити сльозою з отрутою",
				"#Після смерті вороги можуть залишити маленьке павуче яйце, яке можна підібрати",
				"#Яйце буде літати навколо гравця, захищаючи його від ворожих сліз та атак монстрів, але може зламатися, лишивши за собою {{AracBlueSpider}} синього павука",
			}
		},
		[Item.YARN_HEART.ID] = {
			Name = "В'язане Серце",
			Description = {
				"{{WebHeart}} +1 Шовкове Серце"
			}
		},
		[Item.MECHANICAL_EYE.ID] = {
			Name = "Залізне Око",
			Description = {
				"Літає навколо гравця",
				"#Блокує ворожі сльози",
				"#Показує голограму випадкового активного предмету. Кількість зарядів цього предмету така сама, як і кількість зарядів активного предмету гравця",
				"#Коли гравець використає свій активний предмет, додатково буде виконано ефект предмету з голограми",
				"#Після переходу в іншу кімнату або виконанні ефекту, голограма буде показувати вже інший випадковий предмет"
			},
			BFFS = {
				"Виконує ефект двічі, як {{Collectible" ..
				CollectibleType.COLLECTIBLE_CAR_BATTERY .. "}} Акумулятор"
			}
		},
		[Item.GEPTAMERON.ID] = {
			Name = "Гептамерон",
			Description = {
				"Виконує різні ефекти, що залежать від поточної фази предмета:",
				"#{{1}} Показує {{SecretRoom}}{{SuperSecretRoom}} та використовує {{Collectible" ..
				CollectibleType.COLLECTIBLE_DADS_KEY .. "}}",
				"#{{2}} Викликає армію дружніх Зомбі, що можуть залишити 1 {{RottenHeart}} після смерті",
				"#{{3}} Усі вороги в кімнати або {{Charm}}, або лишають 3 {{Trinket" ..
				TrinketType.TRINKET_LOCUST_OF_WRATH .. "}} Сарани після смерті",
				"#{{4}} {{Timer}} На поточну кімнату: Викликає 2 {{Collectible" ..
				CollectibleType.COLLECTIBLE_GUARDIAN_ANGEL .. "}} і дає щит {{HolyMantleSmall}} Священної Мантії",
				"#{{5}} Після смерті усі вороги лишають {{Coin}} монетки, що швидко зникають",
				"#{{6}} 10 секунд пускає ракети по випадково обраним позиціям",
				"#{{7}} Від 1 до 3 ворогів стають міченими. Мічені вороги після смерті лишають пікап, що швидко зникає, та передають мітку іншому ворогу"
			}
		},
		[Item.GLASSES_3D.ID] = {
			Name = "3Д Окуляри",
			Description = {
				"5% шанс вистрілити \"3D\" сльозою, що при влучанні в ворога розділить його на 2 дружні версії",
				"#{{Luck}} 25% шанс при 20 одиницях удачі",
				"#Ці дружні вороги безсмертні, але вони зникнуть після проходження поточної кімнати",
			}
		},
		[Item.MUTAGEN.ID] = {
			Name = "Мутаген",
			Description = {
				"↑ {{Damage}} +1 одиниця Урону",
				"#{{AracBlueSpider}} 20% шанс створити 3-5 {{ColorRainbow}}особливих{{CR}} дружніх павуків при вході до нової кімнати",
				"#{{AracBlueSpider}} Усі павуки (окрім тих, що створюються Павучим Коконом) мають шанс отримати {{ColorRainbow}}особливий{{CR}} ефект"
			}
		},
		[Item.TESTAMENT.ID] = {
			Name = "Заповіт",
			Description = {
				"Переносить гравця до особливого поверху, де знаходяться усі предмети з його інвентаря",
				"#Обравши предмет, ви будете перенесені назад, до кімнати де ви використали Заповіт",
				"#Обраний предмет буде втрачено, але коли ви почнете наступну гру, його можна буде знайти в стартовій кімнаті",
				"#Якщо в гравця немає предметів, то просто створює {{Collectible" ..
				CollectibleType.COLLECTIBLE_EDENS_BLESSING .. "}} Благодать Едема"
			}
		},
		[Item.LIL_ARACHNA.ID] = {
			Name = "Мала Арахна",
			Description = {
				"{{Slow}} Стріляє сльозами, що розпадаються на 4 частини та сповільнюють ворогів при контакті",
				"#Сльози наносят 3.5 одиниці урону",
				"#{{AracBlueSpider}} Сльози з 25% шансом можут накласти на монстра {{StatusWebbed}} ефект Павутиння Арахни",
				"#{{StatusWebbed}} Такі монстри {{Slow}} сповільнюються, слабше відкидуються сльозами гравця та залишають Павучий Кокон після смерті",
				"#{{AracBlueSpider}} Павучі Кокони вилупляються після проходження кімнати, створюючи кілька синіх павуків",
			},
		},
		[Item.DADS_NEWSPAPER.ID] = {
			Name = "Татова Газета",
			Description = {
				"Гравець тримає перед собою скручену газету",
				"#Натисніть двічі кнопку атаки, щоб замахнутися газетою",
				"#{{Confusion}} Наносить непоганий урон ворогам та накладає на них ефект конфузії",
				"#Миттєво вбиває усіх мух та павуків"
			}
		},
		[Item.BEST_BUD_BALL.ID] = {
			Name = "Крутезна Кенто-Куля",
			Description = {
				"{{Throwable}} Кулю можна кинути в боса, щоб спробувати його спіймати",
				"#{{LuckSmall}} Шанс спіймати боса залежить від кількості його здоров'я та одиниць удачі гравця",
				"#{{Friendly}} Якщо бос попався, використайте предмет ще раз, щоб викликати його дружню версію",
				"#Якщо доторкнутися кулі одразу після того як ви змогли спіймати боса, предмет одразу буде перезаряджено",
				"#!!! Одночасно декілька дружніх босів мати неможна"
			}
		},
		[Item.ARACHNOLOGY_101.ID] = {
			Name = "Арахнологія для Початківців",
			Description = {
				"Дає одну з трьох можливих нагород:",
				"#Цікавий факт про павуків",
				"#{{WebHeart}} Шовкове Серце",
				"#{{AracBlueSpider}} Декілька синіх павучків"
			}
		}
	}
end
