local Mod = ArachnaMod

return function()
	return {
		[Mod.PlayerType.ARACHNA] = {
			Name = "Арахна",
			Description = {
				"Не може мати Червоних Контейнерів Здоров'я",
				"#{{WebHeart}} Предмети на підвищення здоров'я дають Шовкові Сердця, замість звичайних контейнерів здоров'я",
				"#Ігнорує сповільнення від павутини на підлозі",
				"#{{Poison}} 25% шанс вістрілити отруйними сльозами замість звичайних",
				"#Павучі Кокони можуть створити {{ColorRainbow}}особливих{CR}} павуків, що будуть мати свої унікальні ефекти",
			}
		},
		[Mod.PlayerType.ARACHNA_B] = {
			Name = "Альт Арахна",
			Description = {
				"Не може мати Червоних Контейнерів Здоров'я",
				"#{{WebHeart}} Предмети на підвищення здоров'я дають Шовкові Сердця, замість звичайних контейнерів здоров'я",
				"#Ігнорує сповільнення від павутини на підлозі",
				"#{{Poison}} 25% шанс вістрілити отруйними сльозами замість звичайних",
				"#{{Collectible" .. Mod.Item.DIVINE_CLOTH.ID .. "}} Подвійне натискання кнопки атаки накладає {{StatusSpiderBite}} особливий ефект на монстрів навколо гравця та наносить 0.5x одиниць урону",
				"#{{StatusSpiderBite}} Монстри під дією ефекту Альт Арахни отримують всі ті ж самі ефекти, які і монстри в павутині {{StatusWebbed}} звичайної Арахни",
				"#↓ Зменшені Павучі Кокони",
				"#{{StatusSpiderBite}} Кокони можуть бути {{ColorRainbow}}особливими{{CR}} і під час вилуплення будуть створювати унікальних павуків такого ж самого кольору",
			}
		},
	}
end
